MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_crs.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_ll_crs.h
  * @brief   Header file of CRS LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_CRS_H
#define STM32C5XX_LL_CRS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(CRS)

/** @defgroup CRS_LL CRS
  * @{
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/* Private macros ----------------------------------------------------------------------------------------------------*/
/* Exported types ----------------------------------------------------------------------------------------------------*/
/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_LL_Exported_Constants LL CRS Constants
  * @{
  */

/** @defgroup CRS_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_CRS_WRITE_REG function.
  * @{
  */
#define LL_CRS_ICR_SYNCOKC                 CRS_ICR_SYNCOKC
#define LL_CRS_ICR_SYNCWARNC               CRS_ICR_SYNCWARNC
#define LL_CRS_ICR_ERRC                    CRS_ICR_ERRC
#define LL_CRS_ICR_ESYNCC                  CRS_ICR_ESYNCC
/**
  * @}
  */

/** @defgroup CRS_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_CRS_READ_REG function.
  * @{
  */
#define LL_CRS_ISR_SYNCOKF                 CRS_ISR_SYNCOKF
#define LL_CRS_ISR_SYNCWARNF               CRS_ISR_SYNCWARNF
#define LL_CRS_ISR_ERRF                    CRS_ISR_ERRF
#define LL_CRS_ISR_ESYNCF                  CRS_ISR_ESYNCF
#define LL_CRS_ISR_SYNCERR                 CRS_ISR_SYNCERR
#define LL_CRS_ISR_SYNCMISS                CRS_ISR_SYNCMISS
#define LL_CRS_ISR_TRIMOVF                 CRS_ISR_TRIMOVF
/**
  * @}
  */

/** @defgroup CRS_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_CRS_READ_REG and  LL_CRS_WRITE_REG functions.
  * @{
  */
#define LL_CRS_CR_SYNCOKIE                 CRS_CR_SYNCOKIE
#define LL_CRS_CR_SYNCWARNIE               CRS_CR_SYNCWARNIE
#define LL_CRS_CR_ERRIE                    CRS_CR_ERRIE
#define LL_CRS_CR_ESYNCIE                  CRS_CR_ESYNCIE
/**
  * @}
  */

/** @defgroup CRS_LL_EC_AUTO_TRIMMING Auto trimming
  * @{
  */
#define LL_CRS_AUTO_TRIMMING_DISABLE       0U                      /*!< Auto trimming disabled (default) */
#define LL_CRS_AUTO_TRIMMING_ENABLE        CRS_CR_AUTOTRIMEN       /*!< Auto trimming enabled */
/**
  * @}
  */

/** @defgroup CRS_LL_EC_SYNC_DIV Synchronization Signal Divider
  * @{
  */
#define LL_CRS_SYNC_DIV_1        0U                                 /*!< Synchronization signal not divided (default) */
#define LL_CRS_SYNC_DIV_2        CRS_CFGR_SYNCDIV_0                        /*!< Synchronization signal divided by 2   */
#define LL_CRS_SYNC_DIV_4        CRS_CFGR_SYNCDIV_1                        /*!< Synchronization signal divided by 4   */
#define LL_CRS_SYNC_DIV_8        (CRS_CFGR_SYNCDIV_1 | CRS_CFGR_SYNCDIV_0) /*!< Synchronization signal divided by 8   */
#define LL_CRS_SYNC_DIV_16       CRS_CFGR_SYNCDIV_2                        /*!< Synchronization signal divided by 16  */
#define LL_CRS_SYNC_DIV_32       (CRS_CFGR_SYNCDIV_2 | CRS_CFGR_SYNCDIV_0) /*!< Synchronization signal divided by 32  */
#define LL_CRS_SYNC_DIV_64       (CRS_CFGR_SYNCDIV_2 | CRS_CFGR_SYNCDIV_1) /*!< Synchronization signal divided by 64  */
#define LL_CRS_SYNC_DIV_128      CRS_CFGR_SYNCDIV                          /*!< Synchronization signal divided by 128 */
/**
  * @}
  */

/** @defgroup CRS_LL_EC_SYNC_SOURCE Synchronization Signal Source
  * @{
  */
#define LL_CRS_SYNC_SOURCE_GPIO       0U                      /*!< Synchronization signal source GPIO */
#define LL_CRS_SYNC_SOURCE_LSE        CRS_CFGR_SYNCSRC_0      /*!< Synchronization signal source LSE */
#define LL_CRS_SYNC_SOURCE_USB        CRS_CFGR_SYNCSRC_1      /*!< Synchronization signal source USB SOF (default) */
#define LL_CRS_SYNC_SOURCE_HSE_1MHZ   (CRS_CFGR_SYNCSRC_0 | \
                                       CRS_CFGR_SYNCSRC_1)    /*!< Synchronization signal source HSE 1MHz */
/**
  * @}
  */

/** @defgroup CRS_LL_EC_SYNC_POLARITY Synchronization Signal Polarity
  * @{
  */
#define LL_CRS_SYNC_POLARITY_RISING        0U                    /*!< Synchronization active on rising edge (default) */
#define LL_CRS_SYNC_POLARITY_FALLING       CRS_CFGR_SYNCPOL      /*!< Synchronization active on falling edge */
/**
  * @}
  */

/** @defgroup CRS_LL_EC_FREQERRORDIR Frequency Error Direction
  * @{
  */
#define LL_CRS_FREQ_ERROR_DIR_UP           0U                  /*!< Upcounting direction, the actual frequency
                                                                    is above the target */
#define LL_CRS_FREQ_ERROR_DIR_DOWN         CRS_ISR_FEDIR       /*!< Downcounting direction, the actual frequency
                                                                    is below the target */
/**
  * @}
  */

/** @defgroup CRS_LL_EC_DEFAULTVALUES Default Values
  * @{
  */
/**
  * @brief Reset value of the RELOAD field.
  * @note The reset value of the RELOAD field corresponds to a target frequency of 48 MHz
  *       and a synchronization signal frequency of 1 kHz (SOF signal from USB).
  */
#define LL_CRS_RELOADVALUE_DEFAULT         0x0000BB7FU

/**
  * @brief Reset value of frequency error limit.
  */
#define LL_CRS_ERRORLIMIT_DEFAULT          0x00000022U

/**
  * @brief Reset value of the HSI144 Calibration field.
  * @note The default value is 0x30U, which corresponds to the middle of the trimming interval.
  *       The trimming step is specified in the product datasheet.
  *       A higher TRIM value corresponds to a higher output frequency.
  */
#define LL_CRS_HSI144CALIBRATION_DEFAULT    0x30U

/**
  * @}
  */

/**
  * @}
  */

/* Exported macros ---------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_LL_Exported_Macros LL CRS Macros
  * @{
  */

