MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_crs.h
/** @defgroup CRS_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in the CRS register.
  * @param  instance CRS instance.
  * @param  reg Register to be written.
  * @param  value Value to be written in the register.
  */
#define LL_CRS_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in the CRS register.
  * @param  instance CRS instance.
  * @param  reg Register to be read.
  * @retval Register value
  */
#define LL_CRS_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)
/**
  * @}
  */

/** @defgroup CRS_LL_EM_Exported_Macros_Calculate_Reload Exported_Macros_Calculate_Reload
  * @{
  */

/**
  * @brief  Macro to calculate the reload value to be set in the CRS register according to target and sync frequencies.
  * @param  ftarget Target frequency (value in Hz).
  * @param  fsync Synchronization signal frequency (value in Hz).
  * @note   The RELOAD value must be selected according to the ratio between
  *         the target frequency and the frequency of the synchronization source after
  *         prescaling. It is then decreased by one to reach the expected
  *         synchronization on the zero value. The formula is as follows:
  *              RELOAD = (ftarget / fsync) -1
  * @retval Reload value (in Hz).
  */
#define LL_CRS_CALCULATE_RELOAD(ftarget, fsync) (((ftarget) / (fsync)) - 1U)

/**
  * @brief  Macro to read the frequency error direction value in CRS register.
  * @param  value Value returned by LL_CRS_GetFreqErrorInfo().
  * @retval Frequency error direction value
  */
#define LL_CRS_READ_FREQ_ERROR_DIRECTION(value) (STM32_READ_BIT((value), CRS_ISR_FEDIR))

/**
  * @brief  Macro to read the frequency error capture value in CRS register.
  * @param  value Value returned by LL_CRS_GetFreqErrorInfo().
  * @retval Frequency error capture value
  */
#define LL_CRS_READ_FREQ_ERROR_CAPTURE(value) (STM32_READ_BIT((value), CRS_ISR_FECAP) >> CRS_ISR_FECAP_Pos)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_LL_Exported_Functions LL CRS Functions
  * @{
  */

/** @defgroup CRS_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable frequency error counter.
  * @rmtoll
  *  CR           CEN           LL_CRS_EnableFreqErrorCounter
  * @param  crsx CRS instance.
  * @note When this bit is set, the CRS_CFGR register is write-protected and cannot be modified.
  */
__STATIC_INLINE void LL_CRS_EnableFreqErrorCounter(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_CEN);
}

/**
  * @brief  Disable frequency error counter.
  * @rmtoll
  *  CR           CEN           LL_CRS_DisableFreqErrorCounter
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_DisableFreqErrorCounter(CRS_TypeDef *crsx)
{
  STM32_CLEAR_BIT(crsx->CR, CRS_CR_CEN);
}

/**
  * @brief  Check whether the frequency error counter is enabled.
  * @rmtoll
  *  CR           CEN           LL_CRS_IsEnabledFreqErrorCounter
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledFreqErrorCounter(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->CR, CRS_CR_CEN) == (CRS_CR_CEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable automatic trimming counter.
  * @rmtoll
  *  CR           AUTOTRIMEN    LL_CRS_EnableAutoTrimming
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_EnableAutoTrimming(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_AUTOTRIMEN);
}

/**
  * @brief  Disable automatic trimming counter.
  * @rmtoll
  *  CR           AUTOTRIMEN    LL_CRS_DisableAutoTrimming
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_DisableAutoTrimming(CRS_TypeDef *crsx)
{
  STM32_CLEAR_BIT(crsx->CR, CRS_CR_AUTOTRIMEN);
}

/**
  * @brief  Check whether automatic trimming is enabled.
  * @rmtoll
  *  CR           AUTOTRIMEN    LL_CRS_IsEnabledAutoTrimming
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledAutoTrimming(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->CR, CRS_CR_AUTOTRIMEN) == (CRS_CR_AUTOTRIMEN)) ? 1UL : 0UL);
}

/**
  * @brief   Set HSI144 oscillator smooth trimming.
  * @rmtoll
  *  CR           TRIM          LL_CRS_SetHSI144SmoothTrimming
  * @param   crsx CRS instance
  * @param   value A number between Min_Data = 0 and Max_Data = 0x5FU.
  * @note    Default value can be set thanks to @ref LL_CRS_HSI144CALIBRATION_DEFAULT.
  * @warning When the AUTOTRIMEN bit is set, this field is controlled by hardware and is read-only.
  */
__STATIC_INLINE void LL_CRS_SetHSI144SmoothTrimming(CRS_TypeDef *crsx, uint32_t value)
{
  STM32_MODIFY_REG(crsx->CR, CRS_CR_TRIM, value << CRS_CR_TRIM_Pos);
}

/**
  * @brief  Get HSI144 oscillator smooth trimming.
  * @rmtoll
  *  CR           TRIM          LL_CRS_GetHSI144SmoothTrimming
  * @param  crsx CRS instance.
  * @retval A number between Min_Data = 0 and Max_Data = 0x5FU.
  */
__STATIC_INLINE uint32_t LL_CRS_GetHSI144SmoothTrimming(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->CR, CRS_CR_TRIM) >> CRS_CR_TRIM_Pos);
}

/**
  * @brief  Set counter reload value.
  * @rmtoll
  *  CFGR         RELOAD        LL_CRS_SetReloadCounter
  * @param  crsx CRS instance.
  * @param  value A number between Min_Data = 0 and Max_Data = 0xFFFF.
  * @note   Default value can be set thanks to @ref LL_CRS_RELOADVALUE_DEFAULT.
  *         Otherwise, it can be calculated using the macro @ref LL_CRS_CALCULATE_RELOAD(_FTARGET_, _FSYNC_).
  */
__STATIC_INLINE void LL_CRS_SetReloadCounter(CRS_TypeDef *crsx, uint32_t value)
{
  STM32_MODIFY_REG(crsx->CFGR, CRS_CFGR_RELOAD, value);
}

/**
  * @brief  Get counter reload value.
  * @rmtoll
  *  CFGR         RELOAD        LL_CRS_GetReloadCounter
  * @param  crsx CRS instance.
  * @retval A number between Min_Data = 0 and Max_Data = 0xFFFF.
  */
__STATIC_INLINE uint32_t LL_CRS_GetReloadCounter(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->CFGR, CRS_CFGR_RELOAD));
}

/**
  * @brief  Set frequency error limit.
  * @rmtoll
  *  CFGR         FELIM         LL_CRS_SetFreqErrorLimit
  * @param  crsx CRS instance.
  * @param  value A number between Min_Data = 0 and Max_Data = 255.
  * @note   Default value can be set thanks to @ref LL_CRS_ERRORLIMIT_DEFAULT.
  */
__STATIC_INLINE void LL_CRS_SetFreqErrorLimit(CRS_TypeDef *crsx, uint32_t value)
{
  STM32_MODIFY_REG(crsx->CFGR, CRS_CFGR_FELIM, value << CRS_CFGR_FELIM_Pos);
}

/**
  * @brief  Get frequency error limit.
  * @rmtoll
  *  CFGR         FELIM         LL_CRS_GetFreqErrorLimit
  * @param  crsx CRS instance.
  * @retval A number between Min_Data = 0 and Max_Data = 255.
  */
__STATIC_INLINE uint32_t LL_CRS_GetFreqErrorLimit(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->CFGR, CRS_CFGR_FELIM) >> CRS_CFGR_FELIM_Pos);
}

/**
  * @brief  Set division factor for SYNC signal.
  * @rmtoll
  *  CFGR         SYNCDIV       LL_CRS_SetSyncDivider
  * @param  crsx CRS instance.
  * @param  divider This parameter can be one of the following values:
  *         @arg @ref LL_CRS_SYNC_DIV_1
  *         @arg @ref LL_CRS_SYNC_DIV_2
  *         @arg @ref LL_CRS_SYNC_DIV_4
  *         @arg @ref LL_CRS_SYNC_DIV_8
  *         @arg @ref LL_CRS_SYNC_DIV_16
  *         @arg @ref LL_CRS_SYNC_DIV_32
  *         @arg @ref LL_CRS_SYNC_DIV_64
  *         @arg @ref LL_CRS_SYNC_DIV_128
  */
__STATIC_INLINE void LL_CRS_SetSyncDivider(CRS_TypeDef *crsx, uint32_t divider)
{
  STM32_MODIFY_REG(crsx->CFGR, CRS_CFGR_SYNCDIV, divider);
}

/**
  * @brief  Get division factor for SYNC signal.
  * @rmtoll
  *  CFGR         SYNCDIV       LL_CRS_GetSyncDivider
  * @param  crsx CRS instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_CRS_SYNC_DIV_1
  *         @arg @ref LL_CRS_SYNC_DIV_2
  *         @arg @ref LL_CRS_SYNC_DIV_4
  *         @arg @ref LL_CRS_SYNC_DIV_8
  *         @arg @ref LL_CRS_SYNC_DIV_16
  *         @arg @ref LL_CRS_SYNC_DIV_32
  *         @arg @ref LL_CRS_SYNC_DIV_64
  *         @arg @ref LL_CRS_SYNC_DIV_128
  */
__STATIC_INLINE uint32_t LL_CRS_GetSyncDivider(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->CFGR, CRS_CFGR_SYNCDIV));
}

/**
  * @brief  Set SYNC signal source.
  * @rmtoll
  *  CFGR         SYNCSRC       LL_CRS_SetSyncSignalSource
  * @param  crsx CRS instance.
  * @param  source This parameter can be one of the following values:
  *         @arg @ref LL_CRS_SYNC_SOURCE_GPIO
  *         @arg @ref LL_CRS_SYNC_SOURCE_LSE
  *         @arg @ref LL_CRS_SYNC_SOURCE_USB
  *         @arg @ref LL_CRS_SYNC_SOURCE_HSE_1MHZ
  */
__STATIC_INLINE void LL_CRS_SetSyncSignalSource(CRS_TypeDef *crsx, uint32_t source)
{
  STM32_MODIFY_REG(crsx->CFGR, CRS_CFGR_SYNCSRC, source);
}

/**
  * @brief  Get SYNC signal source.
  * @rmtoll
  *  CFGR         SYNCSRC       LL_CRS_GetSyncSignalSource
  * @param  crsx CRS instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_CRS_SYNC_SOURCE_GPIO
  *         @arg @ref LL_CRS_SYNC_SOURCE_LSE
  *         @arg @ref LL_CRS_SYNC_SOURCE_USB
  *         @arg @ref LL_CRS_SYNC_SOURCE_HSE_1MHZ
  */
__STATIC_INLINE uint32_t LL_CRS_GetSyncSignalSource(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->CFGR, CRS_CFGR_SYNCSRC));
}

/**
  * @brief  Set input polarity for the SYNC signal source.
  * @rmtoll
  *  CFGR         SYNCPOL       LL_CRS_SetSyncPolarity
  * @param  crsx CRS instance.
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_CRS_SYNC_POLARITY_RISING
  *         @arg @ref LL_CRS_SYNC_POLARITY_FALLING
  */
__STATIC_INLINE void LL_CRS_SetSyncPolarity(CRS_TypeDef *crsx, uint32_t polarity)
{
  STM32_MODIFY_REG(crsx->CFGR, CRS_CFGR_SYNCPOL, polarity);
}

/**
  * @brief  Get input polarity for the SYNC signal source.
  * @rmtoll
  *  CFGR         SYNCPOL       LL_CRS_GetSyncPolarity
  * @param  crsx CRS instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_CRS_SYNC_POLARITY_RISING
  *         @arg @ref LL_CRS_SYNC_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_CRS_GetSyncPolarity(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->CFGR, CRS_CFGR_SYNCPOL));
}

/**
  * @brief  Configure CRS for trimming.
  * @rmtoll
  *  CR           TRIM          LL_CRS_ConfigTrimming \n
  *  CR           AUTOTRIMEN    LL_CRS_ConfigTrimming
  * @param   crsx CRS instance.
  * @param   trimming A number between Min_Data = 0 and Max_Data = 0x5FU.
  * @param   auto_trimming LL_CRS_AUTO_TRIMMING_DISABLE to disable auto trimming.
                          LL_CRS_AUTO_TRIMMING_ENABLE to enable auto trimming.
  * @warning When the auto trimming is enabled, the trimming is controlled by hardware and is read-only.
  */
__STATIC_INLINE void LL_CRS_ConfigTrimming(CRS_TypeDef *crsx, uint32_t trimming, uint32_t auto_trimming)
{
  STM32_WRITE_REG(crsx->CR, ((trimming << CRS_CR_TRIM_Pos) | auto_trimming));
}

/**
  * @brief  Configure CRS for the synchronization.
  * @rmtoll
  *  CFGR         RELOAD        LL_CRS_ConfigSynchronization \n
  *  CFGR         FELIM         LL_CRS_ConfigSynchronization \n
  *  CFGR         SYNCDIV       LL_CRS_ConfigSynchronization \n
  *  CFGR         SYNCSRC       LL_CRS_ConfigSynchronization \n
  *  CFGR         SYNCPOL       LL_CRS_ConfigSynchronization
  * @param  crsx CRS instance.
  * @param  settings This parameter must be a combination of the following values:
  *         @arg @ref LL_CRS_SYNC_DIV_1 or @ref LL_CRS_SYNC_DIV_2 or @ref LL_CRS_SYNC_DIV_4
  *              or @ref LL_CRS_SYNC_DIV_8 or @ref LL_CRS_SYNC_DIV_16 or @ref LL_CRS_SYNC_DIV_32
  *              or @ref LL_CRS_SYNC_DIV_64 or @ref LL_CRS_SYNC_DIV_128
  *         @arg @ref LL_CRS_SYNC_SOURCE_GPIO or @ref LL_CRS_SYNC_SOURCE_LSE
  *              or @ref LL_CRS_SYNC_SOURCE_USB or @ref LL_CRS_SYNC_SOURCE_HSE_1MHZ
  *         @arg @ref LL_CRS_SYNC_POLARITY_RISING or @ref LL_CRS_SYNC_POLARITY_FALLING
  * @param  reload A number between Min_Data = 0 and Max_Data = 255.
  * @param  frequency_error_limit A number between Min_Data = 0 and Max_Data = 0xFFFF.
  */
__STATIC_INLINE void LL_CRS_ConfigSynchronization(CRS_TypeDef *crsx, uint32_t settings, uint32_t reload,
                                                  uint32_t frequency_error_limit)
{
  STM32_MODIFY_REG(crsx->CFGR,
                   CRS_CFGR_SYNCDIV | CRS_CFGR_SYNCSRC | CRS_CFGR_SYNCPOL | CRS_CFGR_RELOAD | CRS_CFGR_FELIM,
                   settings | reload | (frequency_error_limit << CRS_CFGR_FELIM_Pos));
}

/**
  * @}
  */

