MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_crs.h
/** @defgroup CRS_LL_EF_CRS_Management CRS_Management
  * @{
  */

/**
  * @brief  Generate software SYNC event.
  * @rmtoll
  *  CR           SWSYNC        LL_CRS_GenerateEvent_SWSYNC
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_GenerateEvent_SWSYNC(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_SWSYNC);
}

/**
  * @brief  Get the frequency error direction latched at the time of the last
  *         SYNC event.
  * @rmtoll
  *  ISR          FEDIR         LL_CRS_GetFreqErrorDirection
  * @param  crsx CRS instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_CRS_FREQ_ERROR_DIR_UP
  *         @arg @ref LL_CRS_FREQ_ERROR_DIR_DOWN
  */
__STATIC_INLINE uint32_t LL_CRS_GetFreqErrorDirection(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->ISR, CRS_ISR_FEDIR));
}

/**
  * @brief  Get the frequency error counter value latched at the time of the last SYNC event.
  * @rmtoll
  *  ISR          FECAP         LL_CRS_GetFreqErrorCapture
  * @param  crsx CRS instance.
  * @retval A number between Min_Data = 0x0000 and Max_Data = 0xFFFF.
  */
__STATIC_INLINE uint32_t LL_CRS_GetFreqErrorCapture(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_BIT(crsx->ISR, CRS_ISR_FECAP) >> CRS_ISR_FECAP_Pos);
}

/**
  * @brief  Get the frequency error counter value and error direction latched at the time of the last SYNC event.
  * @rmtoll
  *  ISR          FEDIR         LL_CRS_GetFreqErrorInfo \n
  *  ISR          FECAP         LL_CRS_GetFreqErrorInfo
  * @param  crsx CRS instance.
  * @retval A number between Min_Data = 0x0000 and Max_Data = 0x1FFFF.
  */
__STATIC_INLINE uint32_t LL_CRS_GetFreqErrorInfo(const CRS_TypeDef *crsx)
{
  return (uint32_t)(STM32_READ_REG(crsx->ISR) & (CRS_ISR_FECAP | CRS_ISR_FEDIR));
}

/**
  * @}
  */

/** @defgroup CRS_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Get CRS flag(s).
  * @rmtoll
  *  ISR      SYNCOKF           LL_CRS_IsActiveFlag \n
  *  ISR      SYNCWARNF         LL_CRS_IsActiveFlag \n
  *  ISR      ERRF              LL_CRS_IsActiveFlag \n
  *  ISR      ESYNCF            LL_CRS_IsActiveFlag \n
  *  ISR      SYNCERR           LL_CRS_IsActiveFlag \n
  *  ISR      SYNCMISS          LL_CRS_IsActiveFlag \n
  *  ISR      TRIMOVF           LL_CRS_IsActiveFlag
  * @param  crsx CRS instance.
  * @param  mask This parameter can be a combination of the following values:
  *            @arg LL_CRS_ISR_SYNCOKF
  *            @arg LL_CRS_ISR_SYNCWARNF
  *            @arg LL_CRS_ISR_ERRF
  *            @arg LL_CRS_ISR_ESYNCF
  *            @arg LL_CRS_ISR_SYNCERR
  *            @arg LL_CRS_ISR_SYNCMISS
  *            @arg LL_CRS_ISR_TRIMOVF
  * @retval Return 1 if at least one flag is set; otherwise, 0.
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag(const CRS_TypeDef *crsx, uint32_t mask)
{
  return ((STM32_READ_BIT(crsx->ISR, mask) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the SYNC event OK signal occurred.
  * @rmtoll
  *  ISR          SYNCOKF       LL_CRS_IsActiveFlag_SYNCOK
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_SYNCOK(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_SYNCOKF) == (CRS_ISR_SYNCOKF)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the SYNC warning signal occurred.
  * @rmtoll
  *  ISR          SYNCWARNF     LL_CRS_IsActiveFlag_SYNCWARN
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_SYNCWARN(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_SYNCWARNF) == (CRS_ISR_SYNCWARNF)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the synchronization or trimming error signal occurred.
  * @rmtoll
  *  ISR          ERRF          LL_CRS_IsActiveFlag_ERR
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_ERR(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_ERRF) == (CRS_ISR_ERRF)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the expected SYNC signal occurred.
  * @rmtoll
  *  ISR          ESYNCF        LL_CRS_IsActiveFlag_ESYNC
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_ESYNC(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_ESYNCF) == (CRS_ISR_ESYNCF)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the SYNC error signal occurred.
  * @rmtoll
  *  ISR          SYNCERR       LL_CRS_IsActiveFlag_SYNCERR
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_SYNCERR(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_SYNCERR) == (CRS_ISR_SYNCERR)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the SYNC missed error signal occurred.
  * @rmtoll
  *  ISR          SYNCMISS      LL_CRS_IsActiveFlag_SYNCMISS
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_SYNCMISS(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_SYNCMISS) == (CRS_ISR_SYNCMISS)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether trimming overflow or underflow occurred.
  * @rmtoll
  *  ISR          TRIMOVF       LL_CRS_IsActiveFlag_TRIMOVF
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsActiveFlag_TRIMOVF(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->ISR, CRS_ISR_TRIMOVF) == (CRS_ISR_TRIMOVF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear CRS flag(s).
  * @rmtoll
  *  ICR          ERRC          LL_CRS_ClearFlag \n
  *  ICR          SYNCWARNC     LL_CRS_ClearFlag \n
  *  ICR          SYNCOKC       LL_CRS_ClearFlag \n
  *  ICR          ESYNCC        LL_CRS_ClearFlag
  * @param  crsx CRS instance.
  * @param  mask Specifies the CRS flags to be cleared.
  *         This parameter can be a combination of the following values:
  *            @arg LL_CRS_ICR_SYNCOKC
  *            @arg LL_CRS_ICR_SYNCWARNC
  *            @arg LL_CRS_ICR_ERRC
  *            @arg LL_CRS_ICR_ESYNCC
  */
__STATIC_INLINE void LL_CRS_ClearFlag(CRS_TypeDef *crsx, uint32_t mask)
{
  STM32_WRITE_REG(crsx->ICR, mask);
}

/**
  * @brief  Clear the SYNC event OK flag.
  * @rmtoll
  *  ICR          SYNCOKC       LL_CRS_ClearFlag_SYNCOK
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_ClearFlag_SYNCOK(CRS_TypeDef *crsx)
{
  STM32_WRITE_REG(crsx->ICR, CRS_ICR_SYNCOKC);
}

/**
  * @brief  Clear the SYNC warning flag.
  * @rmtoll
  *  ICR          SYNCWARNC     LL_CRS_ClearFlag_SYNCWARN
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_ClearFlag_SYNCWARN(CRS_TypeDef *crsx)
{
  STM32_WRITE_REG(crsx->ICR, CRS_ICR_SYNCWARNC);
}

/**
  * @brief  Clear TRIMOVF, SYNCMISS and SYNCERR bits and consequently also
  *         the ERR flag.
  * @rmtoll
  *  ICR          ERRC          LL_CRS_ClearFlag_ERR
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_ClearFlag_ERR(CRS_TypeDef *crsx)
{
  STM32_WRITE_REG(crsx->ICR, CRS_ICR_ERRC);
}

/**
  * @brief  Clear expected SYNC flag.
  * @rmtoll
  *  ICR          ESYNCC        LL_CRS_ClearFlag_ESYNC
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_ClearFlag_ESYNC(CRS_TypeDef *crsx)
{
  STM32_WRITE_REG(crsx->ICR, CRS_ICR_ESYNCC);
}

/**
  * @}
  */

/** @defgroup CRS_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable interrupt(s).
  * @rmtoll
  *  CR           SYNCOKIE      LL_CRS_EnableIT \n
  *  CR           SYNCWARNIE    LL_CRS_EnableIT \n
  *  CR           ERRIE         LL_CRS_EnableIT \n
  *  CR           ESYNCIE       LL_CRS_EnableIT
  * @param  crsx CRS instance.
  * @param  mask This parameter can be a combination of the following values:
  *            @arg LL_CRS_CR_SYNCOKIE
  *            @arg LL_CRS_CR_SYNCWARNIE
  *            @arg LL_CRS_CR_ERRIE
  *            @arg LL_CRS_CR_ESYNCIE
  */
__STATIC_INLINE void LL_CRS_EnableIT(CRS_TypeDef *crsx, uint32_t mask)
{
  STM32_SET_BIT(crsx->CR, mask);
}

/**
  * @brief  Disable interrupt(s).
  * @rmtoll
  *  CR           SYNCOKIE      LL_CRS_DisableIT \n
  *  CR           SYNCWARNIE    LL_CRS_DisableIT \n
  *  CR           ERRIE         LL_CRS_DisableIT \n
  *  CR           ESYNCIE       LL_CRS_DisableIT
  * @param  crsx CRS instance.
  * @param  mask This parameter can be a combination of the following values:
  *            @arg LL_CRS_CR_SYNCOKIE
  *            @arg LL_CRS_CR_SYNCWARNIE
  *            @arg LL_CRS_CR_ERRIE
  *            @arg LL_CRS_CR_ESYNCIE
  */
__STATIC_INLINE void LL_CRS_DisableIT(CRS_TypeDef *crsx, uint32_t mask)
{
  STM32_CLEAR_BIT(crsx->CR, mask);
}

/**
  * @brief  Indicate whether the interrupt(s) are enabled.
  * @rmtoll
  *  CR           SYNCOKIE      LL_CRS_IsEnabledIT \n
  *  CR           SYNCWARNIE    LL_CRS_IsEnabledIT \n
  *  CR           ERRIE         LL_CRS_IsEnabledIT \n
  *  CR           ESYNCIE       LL_CRS_IsEnabledIT
  * @param  crsx CRS instance.
  * @param  mask This parameter can be a combination of the following values:
  *            @arg LL_CRS_CR_SYNCOKIE
  *            @arg LL_CRS_CR_SYNCWARNIE
  *            @arg LL_CRS_CR_ERRIE
  *            @arg LL_CRS_CR_ESYNCIE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledIT(const CRS_TypeDef *crsx, uint32_t mask)
{
  return ((STM32_READ_BIT(crsx->CR, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SYNC event OK interrupt.
  * @rmtoll
  *  CR           SYNCOKIE      LL_CRS_EnableIT_SYNCOK
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_EnableIT_SYNCOK(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_SYNCOKIE);
}

/**
  * @brief  Disable SYNC event OK interrupt.
  * @rmtoll
  *  CR           SYNCOKIE      LL_CRS_DisableIT_SYNCOK
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_DisableIT_SYNCOK(CRS_TypeDef *crsx)
{
  STM32_CLEAR_BIT(crsx->CR, CRS_CR_SYNCOKIE);
}

/**
  * @brief  Check whether the SYNC event OK interrupt is enabled.
  * @rmtoll
  *  CR           SYNCOKIE      LL_CRS_IsEnabledIT_SYNCOK
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledIT_SYNCOK(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->CR, CRS_CR_SYNCOKIE) == (CRS_CR_SYNCOKIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SYNC warning interrupt.
  * @rmtoll
  *  CR           SYNCWARNIE    LL_CRS_EnableIT_SYNCWARN
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_EnableIT_SYNCWARN(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_SYNCWARNIE);
}

/**
  * @brief  Disable SYNC warning interrupt.
  * @rmtoll
  *  CR           SYNCWARNIE    LL_CRS_DisableIT_SYNCWARN
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_DisableIT_SYNCWARN(CRS_TypeDef *crsx)
{
  STM32_CLEAR_BIT(crsx->CR, CRS_CR_SYNCWARNIE);
}

/**
  * @brief  Check whether the SYNC warning interrupt is enabled.
  * @rmtoll
  *  CR           SYNCWARNIE    LL_CRS_IsEnabledIT_SYNCWARN
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledIT_SYNCWARN(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->CR, CRS_CR_SYNCWARNIE) == (CRS_CR_SYNCWARNIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable synchronization or trimming error interrupt.
  * @rmtoll
  *  CR           ERRIE         LL_CRS_EnableIT_ERR
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_EnableIT_ERR(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_ERRIE);
}

/**
  * @brief  Disable synchronization or trimming error interrupt.
  * @rmtoll
  *  CR           ERRIE         LL_CRS_DisableIT_ERR
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_DisableIT_ERR(CRS_TypeDef *crsx)
{
  STM32_CLEAR_BIT(crsx->CR, CRS_CR_ERRIE);
}

/**
  * @brief  Check whether the synchronization or trimming error interrupt is enabled.
  * @rmtoll
  *  CR           ERRIE         LL_CRS_IsEnabledIT_ERR
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledIT_ERR(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->CR, CRS_CR_ERRIE) == (CRS_CR_ERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable expected SYNC interrupt.
  * @rmtoll
  *  CR           ESYNCIE       LL_CRS_EnableIT_ESYNC
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_EnableIT_ESYNC(CRS_TypeDef *crsx)
{
  STM32_SET_BIT(crsx->CR, CRS_CR_ESYNCIE);
}

/**
  * @brief  Disable expected SYNC interrupt.
  * @rmtoll
  *  CR           ESYNCIE       LL_CRS_DisableIT_ESYNC
  * @param  crsx CRS instance.
  */
__STATIC_INLINE void LL_CRS_DisableIT_ESYNC(CRS_TypeDef *crsx)
{
  STM32_CLEAR_BIT(crsx->CR, CRS_CR_ESYNCIE);
}

/**
  * @brief  Check whether the expected SYNC interrupt is enabled.
  * @rmtoll
  *  CR           ESYNCIE       LL_CRS_IsEnabledIT_ESYNC
  * @param  crsx CRS instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CRS_IsEnabledIT_ESYNC(const CRS_TypeDef *crsx)
{
  return ((STM32_READ_BIT(crsx->CR, CRS_CR_ESYNCIE) == (CRS_CR_ESYNCIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* CRS */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_CRS_H */
